---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryOptionSeparate
source: html/c4216663-7601-84ce-fcbe-b2b062dea379.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryOptionSeparate Property

Option Conflict between Rooms.\nRoom boundary differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictBoundariesVaryOptionSeparate { get; }
```